experiments/results/logs/ramp-hybrid-006/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7072.727ms, rate sampling interval: 14942ms
  Thread calibration: mean lat.: 7258.357ms, rate sampling interval: 15327ms
  Thread calibration: mean lat.: 7224.115ms, rate sampling interval: 15163ms
  Thread calibration: mean lat.: 7255.080ms, rate sampling interval: 15228ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.97s     9.95s   33.55s    79.70%
    Req/Sec    25.31     23.30    75.00     64.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.60s 
 75.000%   14.93s 
 90.000%   24.63s 
 99.000%   31.41s 
 99.900%   33.19s 
 99.990%   33.42s 
 99.999%   33.59s 
100.000%   33.59s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.462     0.000000            1         1.00
       1.506     0.100000         2995         1.11
       1.845     0.200000         5986         1.25
       2.151     0.300000         8986         1.43
       2.625     0.400000        11963         1.67
    1599.487     0.500000        14950         2.00
    4452.351     0.550000        16445         2.22
    7303.167     0.600000        17943         2.50
   10125.311     0.650000        19436         2.86
   12828.671     0.700000        20933         3.33
   14934.015     0.750000        22425         4.00
   16474.111     0.775000        23173         4.44
   18153.471     0.800000        23920         5.00
   19906.559     0.825000        24676         5.71
   21626.879     0.850000        25431         6.67
   23314.431     0.875000        26164         8.00
   24068.095     0.887500        26544         8.89
   24625.151     0.900000        26910        10.00
   25378.815     0.912500        27299        11.43
   26214.399     0.925000        27672        13.33
   27082.751     0.937500        28039        16.00
   27394.047     0.943750        28221        17.78
   27967.487     0.950000        28410        20.00
   28278.783     0.956250        28599        22.86
   28737.535     0.962500        28779        26.67
   29278.207     0.968750        28976        32.00
   29491.199     0.971875        29068        35.56
   30015.487     0.975000        29153        40.00
   30212.095     0.978125        29249        45.71
   30425.087     0.981250        29342        53.33
   31047.679     0.984375        29438        64.00
   31145.983     0.985938        29486        71.11
   31211.519     0.987500        29529        80.00
   31326.207     0.989062        29574        91.43
   31473.663     0.990625        29620       106.67
   32047.103     0.992188        29675       128.00
   32079.871     0.992969        29690       142.22
   32145.407     0.993750        29719       160.00
   32178.175     0.994531        29740       182.86
   32243.711     0.995313        29766       213.33
   32292.863     0.996094        29787       256.00
   32374.783     0.996484        29796       284.44
   32440.319     0.996875        29808       320.00
   32702.463     0.997266        29819       365.71
   33046.527     0.997656        29832       426.67
   33095.679     0.998047        29844       512.00
   33112.063     0.998242        29848       568.89
   33144.831     0.998437        29857       640.00
   33161.215     0.998633        29864       731.43
   33177.599     0.998828        29869       853.33
   33193.983     0.999023        29874      1024.00
   33193.983     0.999121        29874      1137.78
   33210.367     0.999219        29877      1280.00
   33226.751     0.999316        29880      1462.86
   33259.519     0.999414        29887      1706.67
   33259.519     0.999512        29887      2048.00
   33259.519     0.999561        29887      2275.56
   33292.287     0.999609        29890      2560.00
   33292.287     0.999658        29890      2925.71
   33325.055     0.999707        29894      3413.33
   33325.055     0.999756        29894      4096.00
   33325.055     0.999780        29894      4551.11
   33341.439     0.999805        29895      5120.00
   33341.439     0.999829        29895      5851.43
   33390.591     0.999854        29896      6826.67
   33423.359     0.999878        29897      8192.00
   33423.359     0.999890        29897      9102.22
   33472.511     0.999902        29898     10240.00
   33472.511     0.999915        29898     11702.86
   33472.511     0.999927        29898     13653.33
   33538.047     0.999939        29899     16384.00
   33538.047     0.999945        29899     18204.44
   33538.047     0.999951        29899     20480.00
   33538.047     0.999957        29899     23405.71
   33538.047     0.999963        29899     27306.67
   33587.199     0.999969        29900     32768.00
   33587.199     1.000000        29900          inf
#[Mean    =     7967.068, StdDeviation   =     9954.405]
#[Max     =    33554.432, Total count    =        29900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 5.00m, 158.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 6049
  Non-2xx or 3xx responses: 28996
Requests/sec:    100.01
Transfer/sec:    540.36KB